Binary-Bard-sudo/Programs-of-PIC18F4520-Microcontroller-/stepper motor.X/steper motor.c
/*
 * File:   Expt_10_StepperMotor.c
 * Author: Yogesh
 *
 * Created on April 4, 2025, 2:11 PM
 */

#pragma config OSC = INTIO67    // Oscillator Selection bits (Internal oscillator block, port function on RA6 and RA7)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOREN= OFF       // Brown-out Reset enabled in hardware only (SBOREN is disabled)
#pragma config BORV = 3         // Brown Out Reset Voltage bits (Minimum setting)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = PORTBE  // CCP2 MUX bit (CCP2 input/output is multiplexed with RB3)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (RE3 input pin enabled; MCLR disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = ON         // Code Protection bit (Block 0 (000800-001FFFh) code-protected)
#pragma config CP1 = ON         // Code Protection bit (Block 1 (002000-003FFFh) code-protected)
#pragma config CP2 = ON         // Code Protection bit (Block 2 (004000-005FFFh) code-protected)
#pragma config CP3 = ON         // Code Protection bit (Block 3 (006000-007FFFh) code-protected)

// CONFIG5H
#pragma config CPB = ON         // Boot Block Code Protection bit (Boot block (000000-0007FFh) code-protected)
#pragma config CPD = ON         // Data EEPROM Code Protection bit (Data EEPROM not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) not protected from table reads executed in other blocks)

#include <xc.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

#define _XTAL_FREQ 4000000

#define BLUE PORTDbits.RD0
#define PINK PORTDbits.RD1
#define YELLOW PORTDbits.RD2
#define ORANGE PORTDbits.RD3

void main(void)
{   
    OSCCON=0xEF;
    TRISB=0X00;
    TRISD=0X00;
    PORTB=0x00;
    PORTD=0x00;

    unsigned int j;
    
    for(j=1; j<=514; j++)       //For Full Step Sequence
    {
        BLUE=1;  
        PINK=1;   
        YELLOW=0;  
        ORANGE=0; 
        __delay_ms(10);

        BLUE=0;   
        PINK=1;
        YELLOW=1;
        ORANGE=0;
         __delay_ms(10);

        BLUE=0;
        PINK=0;
        YELLOW=1;
        ORANGE=1;
        __delay_ms(10);

        BLUE=1;
        PINK=0;
        YELLOW=0;
        ORANGE=1;
         __delay_ms(10);
    }
    /*for(j=1; j<257; j++)       //For half step sequence
    {    
        BLUE=1;  
        PINK=1;   
        YELLOW=0;   
        ORANGE=0;   
        __delay_ms(10);
     
        BLUE=0;  
        PINK=1;   
        YELLOW=0;   
        ORANGE=0;   
        __delay_ms(10);
     
        BLUE=0;   
        PINK=1;
        YELLOW=1;
        ORANGE=0;
        __delay_ms(10);
        
        BLUE=0;   
        PINK=0;
        YELLOW=1;
        ORANGE=0;
        __delay_ms(10);
     
        BLUE=0;
        PINK=0;
        YELLOW=1;
        ORANGE=1;
        __delay_ms(10);
        
        BLUE=0;
        PINK=0;
        YELLOW=0;
        ORANGE=1;
        __delay_ms(10);

        BLUE=1;
        PINK=0;
        YELLOW=0;
        ORANGE=1;
        __delay_ms(10);

        BLUE=1;
        PINK=0;
        YELLOW=0;
        ORANGE=0;
        __delay_ms(10);
    }*/

    BLUE=0;
    PINK=0;
    YELLOW=0;
    ORANGE=0;
    while(1)
    {
    }
    
}
